#!/bin/bash

cleanup_files() {
  find . -name "*.md" -exec sed -i '

    # 修改漏洞复现数据包中 host 的表示方式
    s/^Host: your-ip/Host: {{Hostname}}/g;

    # 墨安公众号清理
    s/^\*\*扫码关注玄甲\*\*$//g;
    s/^\*\*风眼实验室\*\*$//g;
    s/^\*\*默安逐日实验室\*\*$//g;

    # 删除各种公众号推广信息
    s/^.*本文.*转载请注明来自.*FreeBuf\.COM.*//g;  
    s/\*\*ByteByteGo\*\*\n\n硅谷百万粉丝技术大v官方号,官方网站 www.bytebytego.com\n\n.*篇原创内容\n\n公众号\n\n,//g;

    s/\*\*长按识别二维码.*我.*//g;
    s/推荐↓↓↓//g;

    s/由于传播、利用此文所提供的信息而造成的任何直接或者间接的后果及损失，均由使用者本人负责，雷神众测及文章作者不为此承担任何责任。//g;
    s/雷神众测拥有对此文章的修改和解释权。如欲转载或传播此文章，必须保证此文章的完整性，包括版权声明等全部内容。未经雷神众测允许，不得任意修改或者增减此文章内容，不得以任何方式将其用于商业目的。//g;

    s/.*把公众号.*设为星标.*因为公众号现在只对常读和星标的公众号才能展示大图推送。.*然后点击【设为星标】即可。//g;

    s/^.*实验室是默安科技旗下的技术研究团队，.*//g;

    # 少数派文章清理
    s/^###.*Matrix 精选.*//g;
    s/^###.*Matrix.*首页推荐.*//g;
    s/^\\>.*下载.*少数派.*客户端.*https.*sspai.*com.*client.*关注.*少数派.*https.*sspai.*com.*$//g;
    s/© 本文著作权归作者所有，并授权.*少数派.*独家使用，未经少数派许可，不得转载使用。//g;
    s/.*代表作者.*观点，少数派.*对标题和排版略作.*。//g;
    s/^> 关注.*少数派公众号.*https.*sspai.*com.*J71e.*解锁全新阅读体验.*$//g;
    s/^> 实用、好用的.*正版软件.*https.*sspai.*com.*mall.*少数派为你呈现.*$//g;
    s/^.*Matrix.*https:.*sspai.com.*matrix.*是少数派的.*写作社.*//g;
    s/\\> 实用、好用的.*正版软件.*https.*sspai\.com.*少数派为你呈现 🚀//g;
    s/\\> 年度回顾、好物推荐.*更多精彩尽在.*少数派.*sspai\.com.*//g;
    s/\\> 想申请成为少数派作者.*冲.*sspai\.com.*//g;
    s/\\> 特惠、好用的硬件产品，尽在.*少数派 sspai 官方店铺.*//g;
    s/^想了解如何参与本次征文，赢取各种丰厚奖品，你可以.*点此查看.*https.*sspai.*com.*活动规则和奖品清单。$//g;

    s/^.*跳转到 Cubox 查看.*https:\/\/cubox\.pro\/my\/.*//g;
    s/^\*\*\[.*block ads!.*https.*blockads\.fivefilters\.org.*Why.*https.*blockads.*//g;

    # 格式修正
    s/^### -//g;
    s/\*\*验证\*\*/## 验证/g;
    s/\*\*修复建议\*\*/## 修复建议/g;
    s/^____$//g;
    s/^，$//g;
    s/^\*\*\*\*$//g;
    s/^\*\ \*\ \*$//g;
    s/^\-\-$//g;

    
  ' {} +  
}

cleanup_files